gyr0code/micropython/ports/stm32/adc.c
STATIC bool is_adcx_channel(int channel) {
    #if defined(STM32F411xE)
    // The HAL has an incorrect IS_ADC_CHANNEL macro for the F411 so we check for temp
    return IS_ADC_CHANNEL(channel) || channel == ADC_CHANNEL_TEMPSENSOR;
    #elif defined(STM32F0) || defined(STM32F4) || defined(STM32F7)
    return IS_ADC_CHANNEL(channel);
    #elif defined(STM32H7)
    return __HAL_ADC_IS_CHANNEL_INTERNAL(channel)
           || IS_ADC_CHANNEL(__HAL_ADC_DECIMAL_NB_TO_CHANNEL(channel));
    #elif defined(STM32L4)
    ADC_HandleTypeDef handle;
    handle.Instance = ADCx;
    return IS_ADC_CHANNEL(&handle, channel);
    #elif defined(STM32WB)
    ADC_HandleTypeDef handle;
    handle.Instance = ADCx;
    return __HAL_ADC_IS_CHANNEL_INTERNAL(channel)
           || IS_ADC_CHANNEL(&handle, __HAL_ADC_DECIMAL_NB_TO_CHANNEL(channel));
    #else
    #error Unsupported processor
    #endif
}

STATIC void adc_wait_for_eoc_or_timeout(int32_t timeout) {
    uint32_t tickstart = HAL_GetTick();
    #if defined(STM32F4) || defined(STM32F7)
    while ((ADCx->SR & ADC_FLAG_EOC) != ADC_FLAG_EOC) {
    #elif defined(STM32F0) || defined(STM32H7) || defined(STM32L4) || defined(STM32WB)
    while (READ_BIT(ADCx->ISR, ADC_FLAG_EOC) != ADC_FLAG_EOC) {
    #else
    #error Unsupported processor
        #endif
        if (((HAL_GetTick() - tickstart) > timeout)) {
            break; // timeout
        }
    }
}

STATIC void adcx_clock_enable(void) {
    #if defined(STM32F0) || defined(STM32F4) || defined(STM32F7)
    ADCx_CLK_ENABLE();
    #elif defined(STM32H7)
    __HAL_RCC_ADC3_CLK_ENABLE();
    __HAL_RCC_ADC_CONFIG(RCC_ADCCLKSOURCE_CLKP);
    #elif defined(STM32L4) || defined(STM32WB)
    if (__HAL_RCC_GET_ADC_SOURCE() == RCC_ADCCLKSOURCE_NONE) {
        __HAL_RCC_ADC_CONFIG(RCC_ADCCLKSOURCE_SYSCLK);
    }
    __HAL_RCC_ADC_CLK_ENABLE();
    #else
    #error Unsupported processor
    #endif
}

STATIC void adcx_dma_init_periph(ADC_HandleTypeDef *adch, uint32_t resolution){
    adcx_clock_enable();
    #if defined(STM32F7) || defined(STM32F4)
    adch->Instance                   = ADCx;
    adch->Init.Resolution            = resolution;
    adch->Init.ContinuousConvMode    = ENABLE; 
    adch->Init.DiscontinuousConvMode = DISABLE;
    adch->Init.EOCSelection          = DISABLE;
    adch->Init.ExternalTrigConv      = ADC_EXTERNALTRIGCONV_T1_CC1;
    adch->Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE;
    adch->Init.ClockPrescaler        = ADC_CLOCK_SYNC_PCLK_DIV2;
    adch->Init.ScanConvMode          = DISABLE;
    adch->Init.DataAlign             = ADC_DATAALIGN_RIGHT;
    adch->Init.DMAContinuousRequests = ENABLE;
    #endif
    
    if(HAL_ADC_Init(adch)!=HAL_OK){
        Error_Handle();
    }
    printf("ADCDMASTART\n");
}


STATIC void adcx_init_periph(ADC_HandleTypeDef *adch, uint32_t resolution) {
    adcx_clock_enable();

    adch->Instance = ADCx;
    adch->Init.Resolution = resolution;
    adch->Init.ContinuousConvMode = DISABLE;
    adch->Init.DiscontinuousConvMode = DISABLE;
    #if !defined(STM32F0)
    adch->Init.NbrOfDiscConversion = 0;
    adch->Init.NbrOfConversion = 1;
    #endif
    adch->Init.EOCSelection = ADC_EOC_SINGLE_CONV;
    adch->Init.ExternalTrigConv = ADC_SOFTWARE_START;
    adch->Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
    #if defined(STM32F0)
    adch->Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV4;        // 12MHz
    adch->Init.ScanConvMode = DISABLE;
    adch->Init.DataAlign = ADC_DATAALIGN_RIGHT;
    adch->Init.DMAContinuousRequests = DISABLE;
    adch->Init.SamplingTimeCommon = ADC_SAMPLETIME_55CYCLES_5;    // ~4uS
    #elif defined(STM32F4) || defined(STM32F7)
    adch->Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV2;
    adch->Init.ScanConvMode = DISABLE;
    adch->Init.DataAlign = ADC_DATAALIGN_RIGHT;
    adch->Init.DMAContinuousRequests = DISABLE;
    #elif defined(STM32H7)
    adch->Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV4;
    adch->Init.ScanConvMode = DISABLE;
    adch->Init.LowPowerAutoWait = DISABLE;
    adch->Init.Overrun = ADC_OVR_DATA_OVERWRITTEN;
    adch->Init.OversamplingMode = DISABLE;
    adch->Init.LeftBitShift = ADC_LEFTBITSHIFT_NONE;
    adch->Init.ConversionDataManagement = ADC_CONVERSIONDATA_DR;
    #elif defined(STM32L4) || defined(STM32WB)
    adch->Init.ClockPrescaler = ADC_CLOCK_ASYNC_DIV1;
    adch->Init.ScanConvMode = ADC_SCAN_DISABLE;
    adch->Init.LowPowerAutoWait = DISABLE;
    adch->Init.Overrun = ADC_OVR_DATA_PRESERVED;
    adch->Init.OversamplingMode = DISABLE;
    adch->Init.DataAlign = ADC_DATAALIGN_RIGHT;
    adch->Init.DMAContinuousRequests = DISABLE;
    #else
    #error Unsupported processor
    #endif

    HAL_ADC_Init(adch);

    #if defined(STM32H7)
    HAL_ADCEx_Calibration_Start(adch, ADC_CALIB_OFFSET, ADC_SINGLE_ENDED);
    #endif
    #if defined(STM32L4) || defined(STM32WB)
    HAL_ADCEx_Calibration_Start(adch, ADC_SINGLE_ENDED);
    #endif
}

STATIC void adc_init_single(pyb_obj_adc_t *adc_obj) {

    if (ADC_FIRST_GPIO_CHANNEL <= adc_obj->channel && adc_obj->channel <= ADC_LAST_GPIO_CHANNEL) {
        // Channels 0-16 correspond to real pins. Configure the GPIO pin in ADC mode.
        const pin_obj_t *pin = pin_adc_table[adc_obj->channel];
        mp_hal_pin_config(pin, MP_HAL_PIN_MODE_ADC, MP_HAL_PIN_PULL_NONE, 0);
    }
    
    // Conditional adc configuration for DMA and TIMED modes.
    if(adc_obj->DMA_mode){
        adcx_dma_init_periph(&adc_obj->handle, ADC_RESOLUTION_12B);
    }

    else{
        adcx_init_periph(&adc_obj->handle, ADC_RESOLUTION_12B);
    }

    #if defined(STM32L4) && defined(ADC_DUALMODE_REGSIMULT_INJECSIMULT)
    ADC_MultiModeTypeDef multimode;
    multimode.Mode = ADC_MODE_INDEPENDENT;
    if (HAL_ADCEx_MultiModeConfigChannel(&adc_obj->handle, &multimode) != HAL_OK) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("Can not set multimode on ADC1 channel: %d"), adc_obj->channel);
    }
    #endif
}

STATIC void adc_config_channel(ADC_HandleTypeDef *adc_handle, uint32_t channel) {
    ADC_ChannelConfTypeDef sConfig;

    #if defined(STM32H7) || defined(STM32WB)
    sConfig.Rank = ADC_REGULAR_RANK_1;
    if (__HAL_ADC_IS_CHANNEL_INTERNAL(channel) == 0) {
        channel = __HAL_ADC_DECIMAL_NB_TO_CHANNEL(channel);
    }
    #else
    sConfig.Rank = 1;
    #endif
    sConfig.Channel = channel;

