gyr0code/micropython/ports/stm32/adc.c
    #if defined(STM32F0)
    sConfig.SamplingTime = ADC_SAMPLETIME_55CYCLES_5;
    #elif defined(STM32F4) || defined(STM32F7)
    sConfig.SamplingTime = ADC_SAMPLETIME_15CYCLES;
    #elif defined(STM32H7)
    if (__HAL_ADC_IS_CHANNEL_INTERNAL(channel)) {
        sConfig.SamplingTime = ADC_SAMPLETIME_810CYCLES_5;
    } else {
        sConfig.SamplingTime = ADC_SAMPLETIME_8CYCLES_5;
    }
    sConfig.SingleDiff = ADC_SINGLE_ENDED;
    sConfig.OffsetNumber = ADC_OFFSET_NONE;
    sConfig.OffsetRightShift = DISABLE;
    sConfig.OffsetSignedSaturation = DISABLE;
    #elif defined(STM32L4) || defined(STM32WB)
    if (__HAL_ADC_IS_CHANNEL_INTERNAL(channel)) {
        sConfig.SamplingTime = ADC_SAMPLETIME_247CYCLES_5;
    } else {
        sConfig.SamplingTime = ADC_SAMPLETIME_12CYCLES_5;
    }
    sConfig.SingleDiff = ADC_SINGLE_ENDED;
    sConfig.OffsetNumber = ADC_OFFSET_NONE;
    sConfig.Offset = 0;
    #else
    #error Unsupported processor
    #endif

    #if defined(STM32F0)
    // On the STM32F0 we must select only one channel at a time to sample, so clear all
    // channels before calling HAL_ADC_ConfigChannel, which will select the desired one.
    adc_handle->Instance->CHSELR = 0;
    #endif

    HAL_ADC_ConfigChannel(adc_handle, &sConfig);
}

STATIC uint32_t adc_read_channel(ADC_HandleTypeDef *adcHandle) {
    HAL_ADC_Start(adcHandle);
    adc_wait_for_eoc_or_timeout(EOC_TIMEOUT);
    uint32_t value = ADCx->DR;
    HAL_ADC_Stop(adcHandle);
    return value;
}

STATIC uint32_t adc_config_and_read_channel(ADC_HandleTypeDef *adcHandle, uint32_t channel) {
    adc_config_channel(adcHandle, channel);
    uint32_t raw_value = adc_read_channel(adcHandle);

    #if defined(STM32F4) || defined(STM32F7)
    // ST docs say that (at least on STM32F42x and STM32F43x), VBATE must
    // be disabled when TSVREFE is enabled for TEMPSENSOR and VREFINT
    // conversions to work.  VBATE is enabled by the above call to read
    // the channel, and here we disable VBATE so a subsequent call for
    // TEMPSENSOR or VREFINT works correctly.
    if (channel == ADC_CHANNEL_VBAT) {
        ADC->CCR &= ~ADC_CCR_VBATE;
    }
    #endif

    return raw_value;
}

/******************************************************************************/
/* MicroPython bindings : adc object (single channel)                         */

STATIC void adc_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    pyb_obj_adc_t *self = MP_OBJ_TO_PTR(self_in);
    mp_print_str(print, "<ADC on ");
    mp_obj_print_helper(print, self->pin_name, PRINT_STR);
    mp_printf(print, " channel=%u>", self->channel);
}

/// \classmethod \constructor(pin)
/// Create an ADC object associated with the given pin.
/// This allows you to then read analog values on that pin.
STATIC mp_obj_t adc_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    // check number of arguments
    mp_arg_check_num(n_args, n_kw, 2, 2, false);

    // 1st argument is the pin name
    mp_obj_t pin_obj = args[0];

    const char *adc_mode = mp_obj_str_get_str(args[1]);
    uint32_t channel;

    if (mp_obj_is_int(pin_obj)) {
        channel = adc_get_internal_channel(mp_obj_get_int(pin_obj));
    } else {
        const pin_obj_t *pin = pin_find(pin_obj);
        if ((pin->adc_num & PIN_ADC_MASK) == 0) {
            // No ADC1 function on that pin
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("pin %q does not have ADC capabilities"), pin->name);
        }
        channel = pin->adc_channel;
    }

    if (!is_adcx_channel(channel)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("not a valid ADC Channel: %d"), channel);
    }


    if (ADC_FIRST_GPIO_CHANNEL <= channel && channel <= ADC_LAST_GPIO_CHANNEL) {
        // these channels correspond to physical GPIO ports so make sure they exist
        if (pin_adc_table[channel] == NULL) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("channel %d not available on this board"), channel);
        }
    }

    pyb_obj_adc_t *o = m_new_obj(pyb_obj_adc_t);
    memset(o, 0, sizeof(*o));
    o->base.type = &pyb_adc_type;
    o->pin_name = pin_obj;
    o->channel = channel;

    if (strcmp(adc_mode, ADC_DMA_MODE) == 0){
        o->DMA_mode = true;
        adc_init_single(o);

    }
    else if (strcmp(adc_mode, ADC_TIMED_MODE) == 0){
        o->DMA_mode = false;
        adc_init_single(o);
    }
    
    else{
        mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("ADC measurement type not valid, use 'DMA' or 'TIMED'"));
    }

    return MP_OBJ_FROM_PTR(o);
}

/// \method read()
/// Read the value on the analog pin and return it.  The returned value
/// will be between 0 and 4095.
STATIC mp_obj_t adc_read(mp_obj_t self_in) {
    pyb_obj_adc_t *self = MP_OBJ_TO_PTR(self_in);
    return mp_obj_new_int(adc_config_and_read_channel(&self->handle, self->channel));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(adc_read_obj, adc_read);

/// \method start_dma(buf)
/// Start the ADC with the DMA. Configures the DMA to store converted 
/// adc values in buf. The supplied buffer, buf, must be a 32 bit 
// array.array type of unsigned int, i.e array.array("I",[0]*len)
/// to ensure compatibility with the HAL drivers for the DMA.
// Output will be array of ADC values in range 0 to 4096.
STATIC mp_obj_t adc_start_dma(mp_obj_t self_in, mp_obj_t buf_in, mp_obj_t buf_out){
    
    pyb_obj_adc_t *self = MP_OBJ_TO_PTR(self_in);

    if(!self->DMA_mode){
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("ADC is set up for TIMED mode."));
    }

    // Deinit clashing (unused?) dma interrupts on Stream 4
    dma_deinit(&dma_SPI_4_TX);
    dma_deinit(&dma_SPI_5_TX);

    // Config the DMA handle for ADC-DMA
    static DMA_HandleTypeDef DMAHandle;

    dma_init(&DMAHandle, &dma_ADC_1, DMA_PERIPH_TO_MEMORY, &self->handle);
    self->handle.DMA_Handle = &DMAHandle;
    adc_config_channel(&self->handle, self->channel);

    // Init bufinfo struct to supply to DMA
    mp_buffer_info_t bufinfo;
    mp_get_buffer_raise(buf_in, &bufinfo, MP_BUFFER_WRITE);
    self->dmabuf = bufinfo;
    
    //printf("%d",bufinfo.typecode);

    mp_buffer_info_t bufout;
    mp_get_buffer_raise(buf_out, &bufout, MP_BUFFER_WRITE);
    self->outbuf = bufout;
    
    if(bufinfo.typecode!=73){
        mp_raise_TypeError(MP_ERROR_TEXT("DMA requires unsigned 32bit buffer, use array.array with 'I' typecode."));
    }

    HAL_ADC_Start_DMA(&self->handle, (uint32_t*)bufinfo.buf, bufinfo.len/4);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_3(adc_start_dma_obj, adc_start_dma);

/// \method read_dma()
STATIC mp_obj_t adc_read_dma(mp_obj_t self_in){
    pyb_obj_adc_t *self = MP_OBJ_TO_PTR(self_in);
    // Enable ADC DMA conversion complete interrupt
    NVIC_EnableIRQ(DMA2_Stream4_IRQn);
    // Briefly sleep board while we wait for a DMA callback
    HAL_PWR_EnterSLEEPMode(PWR_MAINREGULATOR_ON, PWR_SLEEPENTRY_WFI);
    //copy DMA buffer to output buffer
    for(int i=0; i<((self->outbuf.len)/4); i++){
        ((uint32_t*)self->outbuf.buf)[i] = ((uint32_t*)self->dmabuf.buf)[i];
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(adc_read_dma_obj, adc_read_dma);

/// \method stop_dma()
// Stop the ADC working with the DMA and deinit the DMA itself, allows
// subsequent calls of read_dma will fail. 
STATIC mp_obj_t adc_stop_dma(mp_obj_t self_in){
    pyb_obj_adc_t *self = MP_OBJ_TO_PTR(self_in);
    if(!self->DMA_mode){
        //mp_raise_msg(&mp_type_OSError, "ADC is set up for TIMED mode.");
    }
    adc_dma_DeInit(&self->handle);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(adc_stop_dma_obj, adc_stop_dma);

/// \method stop_dma()
// Clear the ADC configuration to allow for a change in ADC mode,
// seems to be unecessary.
STATIC mp_obj_t adc_reset(mp_obj_t self_in){
    // Hard Reset ADC peripherals
    __HAL_RCC_ADC_FORCE_RESET();
    __HAL_RCC_ADC_RELEASE_RESET();
    
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(adc_reset_obj, adc_reset);


/// \method read_timed(buf, timer)
///
/// Read analog values into `buf` at a rate set by the `timer` object.
///
/// `buf` can be bytearray or array.array for example.  The ADC values have
/// 12-bit resolution and are stored directly into `buf` if its element size is
/// 16 bits or greater.  If `buf` has only 8-bit elements (eg a bytearray) then
/// the sample resolution will be reduced to 8 bits.
///
/// `timer` should be a Timer object, and a sample is read each time the timer
/// triggers.  The timer must already be initialised and running at the desired
/// sampling frequency.
///
/// To support previous behaviour of this function, `timer` can also be an
/// integer which specifies the frequency (in Hz) to sample at.  In this case
/// Timer(6) will be automatically configured to run at the given frequency.
///
/// Example using a Timer object (preferred way):
///
///     adc = pyb.ADC(pyb.Pin.board.X19)    # create an ADC on pin X19
///     tim = pyb.Timer(6, freq=10)         # create a timer running at 10Hz
///     buf = bytearray(100)                # creat a buffer to store the samples
///     adc.read_timed(buf, tim)            # sample 100 values, taking 10s
///
/// Example using an integer for the frequency:
///
///     adc = pyb.ADC(pyb.Pin.board.X19)    # create an ADC on pin X19
///     buf = bytearray(100)                # create a buffer of 100 bytes
///     adc.read_timed(buf, 10)             # read analog values into buf at 10Hz
///                                         #   this will take 10 seconds to finish
///     for val in buf:                     # loop over all values
///         print(val)                      # print the value out
///
/// This function does not allocate any memory.
STATIC mp_obj_t adc_read_timed(mp_obj_t self_in, mp_obj_t buf_in, mp_obj_t freq_in) {
    pyb_obj_adc_t *self = MP_OBJ_TO_PTR(self_in);

